FROM node:20-alpine

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем метаданные пакетов
COPY package*.json ./

# Устанавливаем все зависимости
RUN npm ci

# Копируем исходный код
COPY . .

# Собираем клиент (React) и компилируем производительный сервер (Express/CommonJS) в dist/
RUN npm run build

# Настраиваем переменные окружения по умолчанию
ENV NODE_ENV=production
ENV PORT=3050

# Наш сервер по умолчанию слушает порт 3000 в контейнере, проксируемый nginx
EXPOSE 3000

# Запускаем готовый скомпилированный сервер
CMD ["npm", "start"]
